In [1]:
import pandas as pd
import numpy as np

In [2]:
print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  2  3  6  2
1  4  1  5  6  9
2  1  4  6  2  9
3  3  6  9  7  9
4  9  7  9  2  2

In [4]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [5]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        7        2        3        6        2
1        4        1        5        6        9
2        1        4        6        2        9
3        3        6        9        7        9
4        9        7        9        2        2

In [6]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        7        2        3        6        2
1        4        1        5        6        9
2        1        4        6        2        9
3        3        6        9        7        9
4        9        7        9        2        2